7767517
171 186
Input            input_x                          0 1 input_x 0=0 1=0 2=0
Convolution      resnet50/conv0/Conv2D            1 1 input_x resnet50/conv0/Conv2D 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=432
BatchNorm        resnet50/batch_normalization/FusedBatchNorm 1 1 resnet50/conv0/Conv2D resnet50/batch_normalization/FusedBatchNorm 0=16 1=0.001000
ReLU             resnet50/Relu                    1 1 resnet50/batch_normalization/FusedBatchNorm resnet50/Relu 0=0.000000
Split            splitncnn_0                      1 2 resnet50/Relu resnet50/Relu_splitncnn_0 resnet50/Relu_splitncnn_1
Convolution      resnet50/resnet1_0/conv_0/Conv2D 1 1 resnet50/Relu_splitncnn_1 resnet50/resnet1_0/conv_0/Conv2D 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=2304
BatchNorm        resnet50/resnet1_0/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet1_0/conv_0/Conv2D resnet50/resnet1_0/batch_normalization/FusedBatchNorm 0=16 1=0.001000
ReLU             resnet50/resnet1_0/Relu          1 1 resnet50/resnet1_0/batch_normalization/FusedBatchNorm resnet50/resnet1_0/Relu 0=0.000000
Convolution      resnet50/resnet1_0/conv_1/Conv2D 1 1 resnet50/resnet1_0/Relu resnet50/resnet1_0/conv_1/Conv2D 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=2304
BatchNorm        resnet50/resnet1_0/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet1_0/conv_1/Conv2D resnet50/resnet1_0/batch_normalization_1/FusedBatchNorm 0=16 1=0.001000
ReLU             resnet50/resnet1_0/Relu_1        1 1 resnet50/resnet1_0/batch_normalization_1/FusedBatchNorm resnet50/resnet1_0/Relu_1 0=0.000000
Convolution      resnet50/resnet1_0/shortcut/Conv2D 1 1 resnet50/Relu_splitncnn_0 resnet50/resnet1_0/shortcut/Conv2D 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=256
BatchNorm        resnet50/resnet1_0/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet1_0/shortcut/Conv2D resnet50/resnet1_0/batch_normalization_2/FusedBatchNorm 0=16 1=0.001000
BinaryOp         resnet50/add                     2 1 resnet50/resnet1_0/Relu_1 resnet50/resnet1_0/batch_normalization_2/FusedBatchNorm resnet50/add 0=0
ReLU             resnet50/Relu_1                  1 1 resnet50/add resnet50/Relu_1 0=0.000000
Split            splitncnn_1                      1 2 resnet50/Relu_1 resnet50/Relu_1_splitncnn_0 resnet50/Relu_1_splitncnn_1
Convolution      resnet50/resnet1_1/conv_0/Conv2D 1 1 resnet50/Relu_1_splitncnn_1 resnet50/resnet1_1/conv_0/Conv2D 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=2304
BatchNorm        resnet50/resnet1_1/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet1_1/conv_0/Conv2D resnet50/resnet1_1/batch_normalization/FusedBatchNorm 0=16 1=0.001000
ReLU             resnet50/resnet1_1/Relu          1 1 resnet50/resnet1_1/batch_normalization/FusedBatchNorm resnet50/resnet1_1/Relu 0=0.000000
Convolution      resnet50/resnet1_1/conv_1/Conv2D 1 1 resnet50/resnet1_1/Relu resnet50/resnet1_1/conv_1/Conv2D 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=2304
BatchNorm        resnet50/resnet1_1/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet1_1/conv_1/Conv2D resnet50/resnet1_1/batch_normalization_1/FusedBatchNorm 0=16 1=0.001000
ReLU             resnet50/resnet1_1/Relu_1        1 1 resnet50/resnet1_1/batch_normalization_1/FusedBatchNorm resnet50/resnet1_1/Relu_1 0=0.000000
Convolution      resnet50/resnet1_1/shortcut/Conv2D 1 1 resnet50/Relu_1_splitncnn_0 resnet50/resnet1_1/shortcut/Conv2D 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=256
BatchNorm        resnet50/resnet1_1/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet1_1/shortcut/Conv2D resnet50/resnet1_1/batch_normalization_2/FusedBatchNorm 0=16 1=0.001000
BinaryOp         resnet50/add_1                   2 1 resnet50/resnet1_1/Relu_1 resnet50/resnet1_1/batch_normalization_2/FusedBatchNorm resnet50/add_1 0=0
ReLU             resnet50/Relu_2                  1 1 resnet50/add_1 resnet50/Relu_2 0=0.000000
Split            splitncnn_2                      1 2 resnet50/Relu_2 resnet50/Relu_2_splitncnn_0 resnet50/Relu_2_splitncnn_1
Convolution      resnet50/resnet1_2/conv_0/Conv2D 1 1 resnet50/Relu_2_splitncnn_1 resnet50/resnet1_2/conv_0/Conv2D 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=2304
BatchNorm        resnet50/resnet1_2/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet1_2/conv_0/Conv2D resnet50/resnet1_2/batch_normalization/FusedBatchNorm 0=16 1=0.001000
ReLU             resnet50/resnet1_2/Relu          1 1 resnet50/resnet1_2/batch_normalization/FusedBatchNorm resnet50/resnet1_2/Relu 0=0.000000
Convolution      resnet50/resnet1_2/conv_1/Conv2D 1 1 resnet50/resnet1_2/Relu resnet50/resnet1_2/conv_1/Conv2D 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=2304
BatchNorm        resnet50/resnet1_2/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet1_2/conv_1/Conv2D resnet50/resnet1_2/batch_normalization_1/FusedBatchNorm 0=16 1=0.001000
ReLU             resnet50/resnet1_2/Relu_1        1 1 resnet50/resnet1_2/batch_normalization_1/FusedBatchNorm resnet50/resnet1_2/Relu_1 0=0.000000
Convolution      resnet50/resnet1_2/shortcut/Conv2D 1 1 resnet50/Relu_2_splitncnn_0 resnet50/resnet1_2/shortcut/Conv2D 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=256
BatchNorm        resnet50/resnet1_2/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet1_2/shortcut/Conv2D resnet50/resnet1_2/batch_normalization_2/FusedBatchNorm 0=16 1=0.001000
BinaryOp         resnet50/add_2                   2 1 resnet50/resnet1_2/Relu_1 resnet50/resnet1_2/batch_normalization_2/FusedBatchNorm resnet50/add_2 0=0
ReLU             resnet50/Relu_3                  1 1 resnet50/add_2 resnet50/Relu_3 0=0.000000
Split            splitncnn_3                      1 2 resnet50/Relu_3 resnet50/Relu_3_splitncnn_0 resnet50/Relu_3_splitncnn_1
Convolution      resnet50/resnet1_3/conv_0/Conv2D 1 1 resnet50/Relu_3_splitncnn_1 resnet50/resnet1_3/conv_0/Conv2D 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=2304
BatchNorm        resnet50/resnet1_3/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet1_3/conv_0/Conv2D resnet50/resnet1_3/batch_normalization/FusedBatchNorm 0=16 1=0.001000
ReLU             resnet50/resnet1_3/Relu          1 1 resnet50/resnet1_3/batch_normalization/FusedBatchNorm resnet50/resnet1_3/Relu 0=0.000000
Convolution      resnet50/resnet1_3/conv_1/Conv2D 1 1 resnet50/resnet1_3/Relu resnet50/resnet1_3/conv_1/Conv2D 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=2304
BatchNorm        resnet50/resnet1_3/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet1_3/conv_1/Conv2D resnet50/resnet1_3/batch_normalization_1/FusedBatchNorm 0=16 1=0.001000
ReLU             resnet50/resnet1_3/Relu_1        1 1 resnet50/resnet1_3/batch_normalization_1/FusedBatchNorm resnet50/resnet1_3/Relu_1 0=0.000000
Convolution      resnet50/resnet1_3/shortcut/Conv2D 1 1 resnet50/Relu_3_splitncnn_0 resnet50/resnet1_3/shortcut/Conv2D 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=256
BatchNorm        resnet50/resnet1_3/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet1_3/shortcut/Conv2D resnet50/resnet1_3/batch_normalization_2/FusedBatchNorm 0=16 1=0.001000
BinaryOp         resnet50/add_3                   2 1 resnet50/resnet1_3/Relu_1 resnet50/resnet1_3/batch_normalization_2/FusedBatchNorm resnet50/add_3 0=0
ReLU             resnet50/Relu_4                  1 1 resnet50/add_3 resnet50/Relu_4 0=0.000000
Split            splitncnn_4                      1 2 resnet50/Relu_4 resnet50/Relu_4_splitncnn_0 resnet50/Relu_4_splitncnn_1
Convolution      resnet50/resnet1_4/conv_0/Conv2D 1 1 resnet50/Relu_4_splitncnn_1 resnet50/resnet1_4/conv_0/Conv2D 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=2304
BatchNorm        resnet50/resnet1_4/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet1_4/conv_0/Conv2D resnet50/resnet1_4/batch_normalization/FusedBatchNorm 0=16 1=0.001000
ReLU             resnet50/resnet1_4/Relu          1 1 resnet50/resnet1_4/batch_normalization/FusedBatchNorm resnet50/resnet1_4/Relu 0=0.000000
Convolution      resnet50/resnet1_4/conv_1/Conv2D 1 1 resnet50/resnet1_4/Relu resnet50/resnet1_4/conv_1/Conv2D 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=2304
BatchNorm        resnet50/resnet1_4/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet1_4/conv_1/Conv2D resnet50/resnet1_4/batch_normalization_1/FusedBatchNorm 0=16 1=0.001000
ReLU             resnet50/resnet1_4/Relu_1        1 1 resnet50/resnet1_4/batch_normalization_1/FusedBatchNorm resnet50/resnet1_4/Relu_1 0=0.000000
Convolution      resnet50/resnet1_4/shortcut/Conv2D 1 1 resnet50/Relu_4_splitncnn_0 resnet50/resnet1_4/shortcut/Conv2D 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=256
BatchNorm        resnet50/resnet1_4/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet1_4/shortcut/Conv2D resnet50/resnet1_4/batch_normalization_2/FusedBatchNorm 0=16 1=0.001000
BinaryOp         resnet50/add_4                   2 1 resnet50/resnet1_4/Relu_1 resnet50/resnet1_4/batch_normalization_2/FusedBatchNorm resnet50/add_4 0=0
ReLU             resnet50/Relu_5                  1 1 resnet50/add_4 resnet50/Relu_5 0=0.000000
Split            splitncnn_5                      1 2 resnet50/Relu_5 resnet50/Relu_5_splitncnn_0 resnet50/Relu_5_splitncnn_1
Convolution      resnet50/resnet2_0/conv_0/Conv2D 1 1 resnet50/Relu_5_splitncnn_1 resnet50/resnet2_0/conv_0/Conv2D 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=0 6=4608
BatchNorm        resnet50/resnet2_0/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet2_0/conv_0/Conv2D resnet50/resnet2_0/batch_normalization/FusedBatchNorm 0=32 1=0.001000
ReLU             resnet50/resnet2_0/Relu          1 1 resnet50/resnet2_0/batch_normalization/FusedBatchNorm resnet50/resnet2_0/Relu 0=0.000000
Convolution      resnet50/resnet2_0/conv_1/Conv2D 1 1 resnet50/resnet2_0/Relu resnet50/resnet2_0/conv_1/Conv2D 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=9216
BatchNorm        resnet50/resnet2_0/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet2_0/conv_1/Conv2D resnet50/resnet2_0/batch_normalization_1/FusedBatchNorm 0=32 1=0.001000
ReLU             resnet50/resnet2_0/Relu_1        1 1 resnet50/resnet2_0/batch_normalization_1/FusedBatchNorm resnet50/resnet2_0/Relu_1 0=0.000000
Convolution      resnet50/resnet2_0/shortcut/Conv2D 1 1 resnet50/Relu_5_splitncnn_0 resnet50/resnet2_0/shortcut/Conv2D 0=32 1=1 11=1 2=1 12=1 3=2 13=2 4=-233 5=0 6=512
BatchNorm        resnet50/resnet2_0/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet2_0/shortcut/Conv2D resnet50/resnet2_0/batch_normalization_2/FusedBatchNorm 0=32 1=0.001000
BinaryOp         resnet50/add_5                   2 1 resnet50/resnet2_0/Relu_1 resnet50/resnet2_0/batch_normalization_2/FusedBatchNorm resnet50/add_5 0=0
ReLU             resnet50/Relu_6                  1 1 resnet50/add_5 resnet50/Relu_6 0=0.000000
Split            splitncnn_6                      1 2 resnet50/Relu_6 resnet50/Relu_6_splitncnn_0 resnet50/Relu_6_splitncnn_1
Convolution      resnet50/resnet2_1/conv_0/Conv2D 1 1 resnet50/Relu_6_splitncnn_1 resnet50/resnet2_1/conv_0/Conv2D 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=9216
BatchNorm        resnet50/resnet2_1/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet2_1/conv_0/Conv2D resnet50/resnet2_1/batch_normalization/FusedBatchNorm 0=32 1=0.001000
ReLU             resnet50/resnet2_1/Relu          1 1 resnet50/resnet2_1/batch_normalization/FusedBatchNorm resnet50/resnet2_1/Relu 0=0.000000
Convolution      resnet50/resnet2_1/conv_1/Conv2D 1 1 resnet50/resnet2_1/Relu resnet50/resnet2_1/conv_1/Conv2D 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=9216
BatchNorm        resnet50/resnet2_1/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet2_1/conv_1/Conv2D resnet50/resnet2_1/batch_normalization_1/FusedBatchNorm 0=32 1=0.001000
ReLU             resnet50/resnet2_1/Relu_1        1 1 resnet50/resnet2_1/batch_normalization_1/FusedBatchNorm resnet50/resnet2_1/Relu_1 0=0.000000
Convolution      resnet50/resnet2_1/shortcut/Conv2D 1 1 resnet50/Relu_6_splitncnn_0 resnet50/resnet2_1/shortcut/Conv2D 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=1024
BatchNorm        resnet50/resnet2_1/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet2_1/shortcut/Conv2D resnet50/resnet2_1/batch_normalization_2/FusedBatchNorm 0=32 1=0.001000
BinaryOp         resnet50/add_6                   2 1 resnet50/resnet2_1/Relu_1 resnet50/resnet2_1/batch_normalization_2/FusedBatchNorm resnet50/add_6 0=0
ReLU             resnet50/Relu_7                  1 1 resnet50/add_6 resnet50/Relu_7 0=0.000000
Split            splitncnn_7                      1 2 resnet50/Relu_7 resnet50/Relu_7_splitncnn_0 resnet50/Relu_7_splitncnn_1
Convolution      resnet50/resnet2_2/conv_0/Conv2D 1 1 resnet50/Relu_7_splitncnn_1 resnet50/resnet2_2/conv_0/Conv2D 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=9216
BatchNorm        resnet50/resnet2_2/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet2_2/conv_0/Conv2D resnet50/resnet2_2/batch_normalization/FusedBatchNorm 0=32 1=0.001000
ReLU             resnet50/resnet2_2/Relu          1 1 resnet50/resnet2_2/batch_normalization/FusedBatchNorm resnet50/resnet2_2/Relu 0=0.000000
Convolution      resnet50/resnet2_2/conv_1/Conv2D 1 1 resnet50/resnet2_2/Relu resnet50/resnet2_2/conv_1/Conv2D 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=9216
BatchNorm        resnet50/resnet2_2/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet2_2/conv_1/Conv2D resnet50/resnet2_2/batch_normalization_1/FusedBatchNorm 0=32 1=0.001000
ReLU             resnet50/resnet2_2/Relu_1        1 1 resnet50/resnet2_2/batch_normalization_1/FusedBatchNorm resnet50/resnet2_2/Relu_1 0=0.000000
Convolution      resnet50/resnet2_2/shortcut/Conv2D 1 1 resnet50/Relu_7_splitncnn_0 resnet50/resnet2_2/shortcut/Conv2D 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=1024
BatchNorm        resnet50/resnet2_2/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet2_2/shortcut/Conv2D resnet50/resnet2_2/batch_normalization_2/FusedBatchNorm 0=32 1=0.001000
BinaryOp         resnet50/add_7                   2 1 resnet50/resnet2_2/Relu_1 resnet50/resnet2_2/batch_normalization_2/FusedBatchNorm resnet50/add_7 0=0
ReLU             resnet50/Relu_8                  1 1 resnet50/add_7 resnet50/Relu_8 0=0.000000
Split            splitncnn_8                      1 2 resnet50/Relu_8 resnet50/Relu_8_splitncnn_0 resnet50/Relu_8_splitncnn_1
Convolution      resnet50/resnet2_3/conv_0/Conv2D 1 1 resnet50/Relu_8_splitncnn_1 resnet50/resnet2_3/conv_0/Conv2D 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=9216
BatchNorm        resnet50/resnet2_3/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet2_3/conv_0/Conv2D resnet50/resnet2_3/batch_normalization/FusedBatchNorm 0=32 1=0.001000
ReLU             resnet50/resnet2_3/Relu          1 1 resnet50/resnet2_3/batch_normalization/FusedBatchNorm resnet50/resnet2_3/Relu 0=0.000000
Convolution      resnet50/resnet2_3/conv_1/Conv2D 1 1 resnet50/resnet2_3/Relu resnet50/resnet2_3/conv_1/Conv2D 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=9216
BatchNorm        resnet50/resnet2_3/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet2_3/conv_1/Conv2D resnet50/resnet2_3/batch_normalization_1/FusedBatchNorm 0=32 1=0.001000
ReLU             resnet50/resnet2_3/Relu_1        1 1 resnet50/resnet2_3/batch_normalization_1/FusedBatchNorm resnet50/resnet2_3/Relu_1 0=0.000000
Convolution      resnet50/resnet2_3/shortcut/Conv2D 1 1 resnet50/Relu_8_splitncnn_0 resnet50/resnet2_3/shortcut/Conv2D 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=1024
BatchNorm        resnet50/resnet2_3/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet2_3/shortcut/Conv2D resnet50/resnet2_3/batch_normalization_2/FusedBatchNorm 0=32 1=0.001000
BinaryOp         resnet50/add_8                   2 1 resnet50/resnet2_3/Relu_1 resnet50/resnet2_3/batch_normalization_2/FusedBatchNorm resnet50/add_8 0=0
ReLU             resnet50/Relu_9                  1 1 resnet50/add_8 resnet50/Relu_9 0=0.000000
Split            splitncnn_9                      1 2 resnet50/Relu_9 resnet50/Relu_9_splitncnn_0 resnet50/Relu_9_splitncnn_1
Convolution      resnet50/resnet2_4/conv_0/Conv2D 1 1 resnet50/Relu_9_splitncnn_1 resnet50/resnet2_4/conv_0/Conv2D 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=9216
BatchNorm        resnet50/resnet2_4/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet2_4/conv_0/Conv2D resnet50/resnet2_4/batch_normalization/FusedBatchNorm 0=32 1=0.001000
ReLU             resnet50/resnet2_4/Relu          1 1 resnet50/resnet2_4/batch_normalization/FusedBatchNorm resnet50/resnet2_4/Relu 0=0.000000
Convolution      resnet50/resnet2_4/conv_1/Conv2D 1 1 resnet50/resnet2_4/Relu resnet50/resnet2_4/conv_1/Conv2D 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=9216
BatchNorm        resnet50/resnet2_4/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet2_4/conv_1/Conv2D resnet50/resnet2_4/batch_normalization_1/FusedBatchNorm 0=32 1=0.001000
ReLU             resnet50/resnet2_4/Relu_1        1 1 resnet50/resnet2_4/batch_normalization_1/FusedBatchNorm resnet50/resnet2_4/Relu_1 0=0.000000
Convolution      resnet50/resnet2_4/shortcut/Conv2D 1 1 resnet50/Relu_9_splitncnn_0 resnet50/resnet2_4/shortcut/Conv2D 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=1024
BatchNorm        resnet50/resnet2_4/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet2_4/shortcut/Conv2D resnet50/resnet2_4/batch_normalization_2/FusedBatchNorm 0=32 1=0.001000
BinaryOp         resnet50/add_9                   2 1 resnet50/resnet2_4/Relu_1 resnet50/resnet2_4/batch_normalization_2/FusedBatchNorm resnet50/add_9 0=0
ReLU             resnet50/Relu_10                 1 1 resnet50/add_9 resnet50/Relu_10 0=0.000000
Split            splitncnn_10                     1 2 resnet50/Relu_10 resnet50/Relu_10_splitncnn_0 resnet50/Relu_10_splitncnn_1
Convolution      resnet50/resnet3_0/conv_0/Conv2D 1 1 resnet50/Relu_10_splitncnn_1 resnet50/resnet3_0/conv_0/Conv2D 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=-233 5=0 6=18432
BatchNorm        resnet50/resnet3_0/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet3_0/conv_0/Conv2D resnet50/resnet3_0/batch_normalization/FusedBatchNorm 0=64 1=0.001000
ReLU             resnet50/resnet3_0/Relu          1 1 resnet50/resnet3_0/batch_normalization/FusedBatchNorm resnet50/resnet3_0/Relu 0=0.000000
Convolution      resnet50/resnet3_0/conv_1/Conv2D 1 1 resnet50/resnet3_0/Relu resnet50/resnet3_0/conv_1/Conv2D 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=36864
BatchNorm        resnet50/resnet3_0/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet3_0/conv_1/Conv2D resnet50/resnet3_0/batch_normalization_1/FusedBatchNorm 0=64 1=0.001000
ReLU             resnet50/resnet3_0/Relu_1        1 1 resnet50/resnet3_0/batch_normalization_1/FusedBatchNorm resnet50/resnet3_0/Relu_1 0=0.000000
Convolution      resnet50/resnet3_0/shortcut/Conv2D 1 1 resnet50/Relu_10_splitncnn_0 resnet50/resnet3_0/shortcut/Conv2D 0=64 1=1 11=1 2=1 12=1 3=2 13=2 4=-233 5=0 6=2048
BatchNorm        resnet50/resnet3_0/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet3_0/shortcut/Conv2D resnet50/resnet3_0/batch_normalization_2/FusedBatchNorm 0=64 1=0.001000
BinaryOp         resnet50/add_10                  2 1 resnet50/resnet3_0/Relu_1 resnet50/resnet3_0/batch_normalization_2/FusedBatchNorm resnet50/add_10 0=0
ReLU             resnet50/Relu_11                 1 1 resnet50/add_10 resnet50/Relu_11 0=0.000000
Split            splitncnn_11                     1 2 resnet50/Relu_11 resnet50/Relu_11_splitncnn_0 resnet50/Relu_11_splitncnn_1
Convolution      resnet50/resnet3_1/conv_0/Conv2D 1 1 resnet50/Relu_11_splitncnn_1 resnet50/resnet3_1/conv_0/Conv2D 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=36864
BatchNorm        resnet50/resnet3_1/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet3_1/conv_0/Conv2D resnet50/resnet3_1/batch_normalization/FusedBatchNorm 0=64 1=0.001000
ReLU             resnet50/resnet3_1/Relu          1 1 resnet50/resnet3_1/batch_normalization/FusedBatchNorm resnet50/resnet3_1/Relu 0=0.000000
Convolution      resnet50/resnet3_1/conv_1/Conv2D 1 1 resnet50/resnet3_1/Relu resnet50/resnet3_1/conv_1/Conv2D 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=36864
BatchNorm        resnet50/resnet3_1/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet3_1/conv_1/Conv2D resnet50/resnet3_1/batch_normalization_1/FusedBatchNorm 0=64 1=0.001000
ReLU             resnet50/resnet3_1/Relu_1        1 1 resnet50/resnet3_1/batch_normalization_1/FusedBatchNorm resnet50/resnet3_1/Relu_1 0=0.000000
Convolution      resnet50/resnet3_1/shortcut/Conv2D 1 1 resnet50/Relu_11_splitncnn_0 resnet50/resnet3_1/shortcut/Conv2D 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=4096
BatchNorm        resnet50/resnet3_1/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet3_1/shortcut/Conv2D resnet50/resnet3_1/batch_normalization_2/FusedBatchNorm 0=64 1=0.001000
BinaryOp         resnet50/add_11                  2 1 resnet50/resnet3_1/Relu_1 resnet50/resnet3_1/batch_normalization_2/FusedBatchNorm resnet50/add_11 0=0
ReLU             resnet50/Relu_12                 1 1 resnet50/add_11 resnet50/Relu_12 0=0.000000
Split            splitncnn_12                     1 2 resnet50/Relu_12 resnet50/Relu_12_splitncnn_0 resnet50/Relu_12_splitncnn_1
Convolution      resnet50/resnet3_2/conv_0/Conv2D 1 1 resnet50/Relu_12_splitncnn_1 resnet50/resnet3_2/conv_0/Conv2D 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=36864
BatchNorm        resnet50/resnet3_2/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet3_2/conv_0/Conv2D resnet50/resnet3_2/batch_normalization/FusedBatchNorm 0=64 1=0.001000
ReLU             resnet50/resnet3_2/Relu          1 1 resnet50/resnet3_2/batch_normalization/FusedBatchNorm resnet50/resnet3_2/Relu 0=0.000000
Convolution      resnet50/resnet3_2/conv_1/Conv2D 1 1 resnet50/resnet3_2/Relu resnet50/resnet3_2/conv_1/Conv2D 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=36864
BatchNorm        resnet50/resnet3_2/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet3_2/conv_1/Conv2D resnet50/resnet3_2/batch_normalization_1/FusedBatchNorm 0=64 1=0.001000
ReLU             resnet50/resnet3_2/Relu_1        1 1 resnet50/resnet3_2/batch_normalization_1/FusedBatchNorm resnet50/resnet3_2/Relu_1 0=0.000000
Convolution      resnet50/resnet3_2/shortcut/Conv2D 1 1 resnet50/Relu_12_splitncnn_0 resnet50/resnet3_2/shortcut/Conv2D 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=4096
BatchNorm        resnet50/resnet3_2/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet3_2/shortcut/Conv2D resnet50/resnet3_2/batch_normalization_2/FusedBatchNorm 0=64 1=0.001000
BinaryOp         resnet50/add_12                  2 1 resnet50/resnet3_2/Relu_1 resnet50/resnet3_2/batch_normalization_2/FusedBatchNorm resnet50/add_12 0=0
ReLU             resnet50/Relu_13                 1 1 resnet50/add_12 resnet50/Relu_13 0=0.000000
Split            splitncnn_13                     1 2 resnet50/Relu_13 resnet50/Relu_13_splitncnn_0 resnet50/Relu_13_splitncnn_1
Convolution      resnet50/resnet3_3/conv_0/Conv2D 1 1 resnet50/Relu_13_splitncnn_1 resnet50/resnet3_3/conv_0/Conv2D 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=36864
BatchNorm        resnet50/resnet3_3/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet3_3/conv_0/Conv2D resnet50/resnet3_3/batch_normalization/FusedBatchNorm 0=64 1=0.001000
ReLU             resnet50/resnet3_3/Relu          1 1 resnet50/resnet3_3/batch_normalization/FusedBatchNorm resnet50/resnet3_3/Relu 0=0.000000
Convolution      resnet50/resnet3_3/conv_1/Conv2D 1 1 resnet50/resnet3_3/Relu resnet50/resnet3_3/conv_1/Conv2D 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=36864
BatchNorm        resnet50/resnet3_3/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet3_3/conv_1/Conv2D resnet50/resnet3_3/batch_normalization_1/FusedBatchNorm 0=64 1=0.001000
ReLU             resnet50/resnet3_3/Relu_1        1 1 resnet50/resnet3_3/batch_normalization_1/FusedBatchNorm resnet50/resnet3_3/Relu_1 0=0.000000
Convolution      resnet50/resnet3_3/shortcut/Conv2D 1 1 resnet50/Relu_13_splitncnn_0 resnet50/resnet3_3/shortcut/Conv2D 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=4096
BatchNorm        resnet50/resnet3_3/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet3_3/shortcut/Conv2D resnet50/resnet3_3/batch_normalization_2/FusedBatchNorm 0=64 1=0.001000
BinaryOp         resnet50/add_13                  2 1 resnet50/resnet3_3/Relu_1 resnet50/resnet3_3/batch_normalization_2/FusedBatchNorm resnet50/add_13 0=0
ReLU             resnet50/Relu_14                 1 1 resnet50/add_13 resnet50/Relu_14 0=0.000000
Split            splitncnn_14                     1 2 resnet50/Relu_14 resnet50/Relu_14_splitncnn_0 resnet50/Relu_14_splitncnn_1
Convolution      resnet50/resnet3_4/conv_0/Conv2D 1 1 resnet50/Relu_14_splitncnn_1 resnet50/resnet3_4/conv_0/Conv2D 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=36864
BatchNorm        resnet50/resnet3_4/batch_normalization/FusedBatchNorm 1 1 resnet50/resnet3_4/conv_0/Conv2D resnet50/resnet3_4/batch_normalization/FusedBatchNorm 0=64 1=0.001000
ReLU             resnet50/resnet3_4/Relu          1 1 resnet50/resnet3_4/batch_normalization/FusedBatchNorm resnet50/resnet3_4/Relu 0=0.000000
Convolution      resnet50/resnet3_4/conv_1/Conv2D 1 1 resnet50/resnet3_4/Relu resnet50/resnet3_4/conv_1/Conv2D 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=-233 5=0 6=36864
BatchNorm        resnet50/resnet3_4/batch_normalization_1/FusedBatchNorm 1 1 resnet50/resnet3_4/conv_1/Conv2D resnet50/resnet3_4/batch_normalization_1/FusedBatchNorm 0=64 1=0.001000
ReLU             resnet50/resnet3_4/Relu_1        1 1 resnet50/resnet3_4/batch_normalization_1/FusedBatchNorm resnet50/resnet3_4/Relu_1 0=0.000000
Convolution      resnet50/resnet3_4/shortcut/Conv2D 1 1 resnet50/Relu_14_splitncnn_0 resnet50/resnet3_4/shortcut/Conv2D 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=-233 5=0 6=4096
BatchNorm        resnet50/resnet3_4/batch_normalization_2/FusedBatchNorm 1 1 resnet50/resnet3_4/shortcut/Conv2D resnet50/resnet3_4/batch_normalization_2/FusedBatchNorm 0=64 1=0.001000
BinaryOp         resnet50/add_14                  2 1 resnet50/resnet3_4/Relu_1 resnet50/resnet3_4/batch_normalization_2/FusedBatchNorm resnet50/add_14 0=0
ReLU             resnet50/Relu_15                 1 1 resnet50/add_14 resnet50/Relu_15 0=0.000000
Pooling          resnet50/global_avg_pool         1 1 resnet50/Relu_15 resnet50/global_avg_pool 0=1 4=1
InnerProduct     resnet50/output/MatMul           1 1 resnet50/global_avg_pool resnet50/output/MatMul 0=10 1=0 2=640
